001000 IDENTIFICATION DIVISION.
001100 PROGRAM-ID. gen.
002000 DATA DIVISION.
002100 WORKING-STORAGE SECTION.
002110 01 MIN-NUMBER PIC 9(1) VALUE 0.
002120 01 MAX-NUMBER PIC 9(1) VALUE 9.
002130 01 RANDOM-NUMBER PIC 9(1).
003000 PROCEDURE DIVISION.
003100 MAIN-PARA.
003110 PERFORM 10 TIMES
003111 COMPUTE RANDOM-NUMBER = FUNCTION RANDOM *
003112     (MAX-NUMBER - MIN-NUMBER + 1) +
003113     MIN-NUMBER
003114 DISPLAY 'RANDOM NUMBER:' RANDOM-NUMBER
003115 END-PERFORM.
004000 STOP RUN.