000001*NOTE: RANDOM ALWAYS GENERATE THE SAME NUMBERS IN ORDER.
000002*SEED SHOULD BE CHANGED FOR DIFFERENT STARTING VALUE.
001000 identification division.
001100 program-id. spr.

002000 data division.
002100 working-storage section.
002110 01 USER-CHOICE PIC 9(1) value 0.
002120 01 COM-CHOICE PIC 9(1) value 0.

002130 01 MIN-NUMBER PIC 9(1) value 1.
002140 01 MAX-NUMBER PIC 9(1) value 3.
002150 01 SEED PIC 9(3) value 123.

002160 01 YS PIC X(18) value "You chose scissors".
002161 01 YP PIC X(15) value "You chose paper".
002162 01 YR PIC X(14) value "You chose rock".

002170 01 CS PIC X(30) value " and computer chose scissors. ".
002171 01 CP PIC X(27) value " and computer chose paper. ".
002172 01 CR PIC X(26) value " and computer chose rock. ".

002180 01 WIN PIC X(8) value "You win.".
002181 01 LOSE PIC X(9) value "You lose.".
002182 01 DRAW PIC X(12) value "It's a draw.".

002190 01 RESULT PIC X(80).

003000 procedure division.
003100 START-PROGRAM.
003110 perform VALIDATE-INPUT.
003120 perform GENERATE-COM.
003130 perform COMPARE-CHOICE.
003140 display RESULT.

003200 VALIDATE-INPUT.
003210 evaluate true also true
003220 when USER-CHOICE >= 1 also USER-CHOICE <= 3
003221     continue
003230 when other
003231     display "Choose Scissors (1), Paper (2) or Rock (3)"
003232     accept USER-CHOICE
003233     perform VALIDATE-INPUT
003240 end-evaluate.

003300 GENERATE-COM.
003310 perform
003311 compute COM-CHOICE = function random(SEED) * 
003312     (MAX-NUMBER - MIN-NUMBER + 1) +
003313     MIN-NUMBER
003320 end-perform.

003400 COMPARE-CHOICE.
003410 evaluate true also true

003420 when USER-CHOICE = 1 also COM-CHOICE = 1
003421     STRING YS DELIMITED BY SIZE
003422         CS DELIMITED BY SIZE
003423         DRAW DELIMITED BY SIZE
003424     INTO RESULT

003430 when USER-CHOICE = 1 also COM-CHOICE = 2
003431     STRING YS DELIMITED BY SIZE
003432         CP DELIMITED BY SIZE
003433         WIN DELIMITED BY SIZE
003434     INTO RESULT

003440 when USER-CHOICE = 1 also COM-CHOICE = 3
003441     STRING YS DELIMITED BY SIZE
003442         CR DELIMITED BY SIZE
003443         LOSE DELIMITED BY SIZE
003444     INTO RESULT

003450 when USER-CHOICE = 2 also COM-CHOICE = 1
003451     STRING YP DELIMITED BY SIZE
003452         CS DELIMITED BY SIZE
003453         LOSE DELIMITED BY SIZE
003454     INTO RESULT

003460 when USER-CHOICE = 2 also COM-CHOICE = 2
003461     STRING YP DELIMITED BY SIZE
003462         CP DELIMITED BY SIZE
003463         DRAW DELIMITED BY SIZE
003464     INTO RESULT

003470 when USER-CHOICE = 2 also COM-CHOICE = 3
003471     STRING YP DELIMITED BY SIZE
003472         CR DELIMITED BY SIZE
003473         WIN DELIMITED BY SIZE
003474     INTO RESULT

003480 when USER-CHOICE = 3 also COM-CHOICE = 1
003481     STRING YR DELIMITED BY SIZE
003482         CS DELIMITED BY SIZE
003483         WIN DELIMITED BY SIZE
003484     INTO RESULT

003490 when USER-CHOICE = 3 also COM-CHOICE = 2
003491     STRING YR DELIMITED BY SIZE
003492         CP DELIMITED BY SIZE
003493         LOSE DELIMITED BY SIZE
003494     INTO RESULT

003500 when USER-CHOICE = 3 also COM-CHOICE = 3
003501     STRING YR DELIMITED BY SIZE
003502         CR DELIMITED BY SIZE
003503         DRAW DELIMITED BY SIZE
003504     INTO RESULT

004000 stop run.